print("โปรแกรมคำนวณ BMI และแปลผลสุขภาพ\n")
hight = float(input("ส่วนสูงของคุณหน่อย m."))
wieght = int(input("น้ำหนักของคุณหน่อย Kg."))

total = (hight * hight)
bmi = (wieght/total)
print("BMI ของคุณคือ" ,bmi,"หน่วย")
if bmi >=25:
    print("อยู่ในเกณฑ์ อ้วน\n")
elif bmi >=23:
    print("อยู่ในเกณฑ์ น้ำหนักเกิน\n")
elif bmi >= 18.5:
    print("อยู่ในเกณฑ์ ปกติ\n")

else:
    print("อยู่ในเกณฑ์ น้ำหนักน้อย\n")

print("ชื่นชมคนที่สุขภาพดีครับ ส่วนคนที่ผอมหรืออ้วนเกินอย่าลืมคุมอาหารและออกกำลังกายนะครับ")
print("Coding by นาย กิตติพัศ ราชเล็ก ม.4/4 เลขที่ 8")